# 1).join() — შექმენი სია სახელებით და შეაერთე ისინი ერთ სტრიქონად მძიმით გამოყოფილი ფორმატით, შემდეგ დაბეჭდე ტექსტი „გუნდის წევრები: ...“.
names = ["daviti", "giorgi", "levani", "luka"]
names2 = ",".join(names)
print("გუნდის წევრები ", names2)
# 2).split() — მომხმარებლისგან მიიღე წინადადება და დაშალე სიტყვებად; დაბეჭდე რამდენი სიტყვაა ტექსტში.
text = input("Enter whatever text you want.")
text2 = text.split()
print(len(text2))
# 3).isupper() — შექმენი ფუნქცია, რომელიც შეამოწმებს, არის თუ არა შეყვანილი პაროლი მხოლოდ დიდი ასოებით დაწერილი.
def is_passsword(password):
    if password.isupper():
        print("თქვენი პაროლი დიდი ასოებითაა დაწერილი")
    else:
        print("თქვენი პაროლი პატარა ასოებითაა დაწერილი")
# 4).islower() — შეამოწმე, შეიცავს თუ არა ტექსტი მხოლოდ პატარა ასოებს, და თუ არა — დაბეჭდე „ტექსტი შერეულია“.
tester_text = input("Enter whatever text you want")

if tester_text.islower():
    print("თქვენი ტექსტი პატრაა ასოებითაა დაწერილი")
else:
     print("თქვენი თექსტი დიდი ასოებითაა დაწერილი")
# 5).swapcase() — მომხმარებლის მიერ შეყვანილ წინადადებაში შეცვალე ასოების რეგისტრი და დაბეჭდე ახალი ვარიანტი.
text2 = input("Enter whatever text you want")
text3 = text2.swapcase()
print(text3)
# 6).strip() — მიიღე სტრიქონი, რომელსაც ორივე მხარეს აქვს გამოტოვებები ან ტირეები, მოაშორე ისინი და დაბეჭდე გასუფთავებული ტექსტი.
text5 = input("Enter text with space and -")
text6 = text5.strip(" -")
print(text6)
# 7).count() — მიიღე ტექსტი და დაითვალე, რამდენჯერ გვხვდება მასში ასო "ა". დაბეჭდე შედეგი.
text = input("enter text ")
text2 = text.count("ა")
print(text2)
# 8).append() — შექმენი ცარიელი სია და for ციკლის საშუალებით დაამატე მასში 1-დან 10-მდე რიცხვები.
numbers = []  
for i in range(1, 11): 
    numbers.append(i)
print(numbers)
# 9)for loop + list — დაწერე ციკლი, რომელიც დაბეჭდავს მხოლოდ ლუწ რიცხვებს სიიდან და დაამატე ისინი ახალ სიაში.
numbers = [3, 22, 97, 68, 675, 79, 60, 11]
list = []    
for i in numbers:
    if i % 2 == 0:     
        list.append(i)
print(list)

# 10)split - join: მომხმარებლისგან მიიღე წინადადება. დაშალე სიტყვებად (split), დათვალე რამდენი სიტყვაა, შემდეგ თითოეული სიტყვის პირველი ასო გადააქციე დიდად,
# შემდეგ შეაერთე ისევ (join) და დაბეჭდე შედეგი (წინადადება და სიტყვების რაოდენობა)“
