# 1) while loop ს მეშვეობით გამოიტანეთ თქვენი სახელი 10-ჯერ 

# 2) while loop ის მეშვეობით გამოიტანეთ რიცხვები 10 ის ჩათვლით 

# 3) while loop ის მეშვეობით გამოიტანეთ რიცხვები 0 დან 100 მდე

# dv 1
i = 0
while i < 10:
    print("daviti")
    i = i +1

# dv 2
i = 0
while i <= 10:
    print(i)
    i = i + 1

# dv 3
i = 0
while i < 100:
    print(i)
    i = i + 1

# 4) შექმენით ცვლადი სადაც შეინახავთ თქვენს ასაკს შემდეგ if else 'ს გამოყენებით შეამოწმეთ შემდეგი რამ თუ age >= იქნება 18 ის მაშინ დაპრინტეთ "თქვენ იხდით სტანდარტული ფასებით" სხვა შემთხვევაში დაპრინტეტ "შენ მიიღე ფასდაკლება"

# 5) შექმენით ცვლადი სადაც მომხმარებელს შემოატანინებთ თავის ასაკს თუ მომხმარებლის ასაკი მეტი იქნება 18 ძე მაშინ გამოიტანეთ "კეთილი იყოს შენი მობრძანება" სხვა შემთხვევაში "შენ ხარ არასრულწლოვანი"

# dv 4
age = 13
if age >= 18:
    print("regular price")
else:
    print("discount")

# dv 5
age = int(input("enter your age:" ))
if age >= 18:
    print("კეთილი იყოს შენო მობრძანებ")
else:
    print("შენ ხარ არასრულწლოვანი")