# 1) შექმენით ცვლადი name სადაც გექნებათ თქვენი სახელი ხოლო, შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა

# 2) print ფუნქციის გამოყენებით მოახდინეთ მათემატიკური ოპერაციები დღევანდელი ნასწავლი მასალით. მიმატება გამოკლება გამრავლება და გაყოფა

# 3) შექმენით ცვლადი სახელად num ამ ცვლადში შეინახეთ თქვენთვის სასურველი რიცხვი. და მაგ რიცხვის მნიშვნელობას დაემატოს ( 1 ) თუ არის 10 გახდეს 11

# 4) კომენტარების სახით ახსენით არის თუ არა სასარგებლო ცვლადის, განახლება და თუ ფიქრობთ რომ კი მაშინ რატომ?

# 5) უყურეთ დღევანდელი გაკვეთილის ჩანაწერს
 
# dv1
name = "daviti"
name ="giorgi"
print(name)

# dv2 
num1 = 10
num2 = 5
print( num1 + num2)
print( num1 - num2)
print( num1 * num2)
print( num1 / num2)

# dv3
num = 10
print(10 + 1)

# dv4
# cvladis ganaxleba imitoma kai ro naklebi kodis wera gviwevs

