// 2) კომენტარებით კარგად ჩამოაყალიბეთ თუ რა არის ფუნქცია
// კომენტარი არის ჩაშენებული კოდის ბლოკი რომელიც გამოიყენება კონკრეტული დავალების შესასრულებლად 

// 3) კომენტარებით ახსენით რა არის Default Parameter და მოიყვანეთ 1 მაგალითი
// დეფაულტ პარამეტრი არის „საწყისი მნიშვნელობა“.ანუ თუ შენ არაფერს დაწერ, პროგრამა ავტომატურად ამ მნიშვნელობას გამოიყენებს.
function hello(name = "Guest"){
    return  "გამარჯობა, " + name;
}
console.log(greet());  
// 4) შექმენი ფუნქცია რომელსაც გადაეცემა 1 პარამეტრი score და უნდა დააბრუნო შესაბამისი შედეგი
// A  100 - 90
// B  90 - 75
// C  75 - 60
// F  60 - 0 
function getGrade(score) {
    if (score >= 90 && score <= 100) {
        return "A";
    } 
    else if (score >= 75) {
        return "B";
    } 
    else if (score >= 60) {
        return "C";
    } 
    else if (score >= 0) {
        return "F";
    }
}


// 5) BONUS 

// დავალება: "ჭკვიანი ბანკომატის ლოგიკა" (Smart ATM)
// წარმოიდგინე, რომ წერ პროგრამას ბანკომატისთვის. უნდა შექმნა ფუნქცია სახელად atmWithdraw, რომელიც მიიღებს ორ არგუმენტს:

// requestedAmount (მოთხოვნილი თანხა - რიცხვი)

// accountBalance (ანგარიშზე არსებული ბალანსი - რიცხვი)

// ბანკომატს აქვს შემდეგი მკაცრი წესები:

// წესი 1: ბანკომატს შეუძლია გასცეს მაქსიმუმ 500 ლარი ერთ ჯერზე. თუ მომხმარებელი ითხოვს 500-ზე მეტს, ფუნქციამ უნდა დააბრუნოს ტექსტი: "შეცდომა: ერთჯერადად მაქსიმალური თანხაა 500 ლარი."

// წესი 2: ბანკომატი გასცემს მხოლოდ 10-ის ჯერად თანხებს (ანუ 10, 20, 50, 110 და ა.შ. 15 ან 23 ლარს ვერ გასცემს). თუ თანხა არ არის 10-ის ჯერადი, უნდა დააბრუნოს: "შეცდომა: გთხოვთ მიუთითოთ 10-ის ჯერადი თანხა."

// წესი 3: თუ მომხმარებელს ანგარიშზე არ აქვს საკმარისი თანხა (requestedAmount > accountBalance), უნდა დააბრუნოს: "შეცდომა: ანგარიშზე არ არის საკმარისი თანხა."

// წესი 4: თუ ყველა პირობა დაკმაყოფილდა, ფუნქციამ უნდა დააბრუნოს ახალი ბალანსი (ანუ ბალანსს გამოკლებული მოთხოვნილი თანხა) ასეთი ტექსტით: "ტრანზაქცია წარმატებულია. თქვენი ახალი ბალანსია: X ლარი." (X-ის ნაცვლად უნდა იყოს ნაშთი).
function atmWithdraw(amount, balance){
    if(amount > balance){
        return "შეცდომა: ანგარიშზე არ არის საკმარისი თანხა."    
    } else if(amount % 10 != 0){
        return "შეცდომა: გთხოვთ მიუთითოთ 10-ის ჯერადი თანხა."
    } else if(amount > 500){
        return "შეცდომა: ერთჯერადად მაქსიმალური თანხაა 500 ლარი."
    }

    return `ტრანზაქცია წარმატებულია. თქვენი ახალი ბალანსია: ${balance - amount} ლარი.`
}

console.log(atmWithdraw(200, 1000))