# 1)for loop ის მეშვეობით დაბეჭდეთ როცხვები 1 დან 10 ის ჩათვლით 

# 2)for loop ის მეშვეობით დაბეჭდეთ თქვენი სახელი 100 ჯერ 

# 3)შექმენით ცვლადი სადაც შეინახავთ საკუთარ სახელს for loop ის მეშვეობით გადაურეთ თქვენს ცვლადს და გამოიტანეთ თქვენს სახელში მყოფი ყველა ასო 

# 4)for loop ის მეშვეობით შექმენით 0 დან 20 მდე რიცხვების ნაკადი და გამოიტანეთ ყოველი მეორე რიცხვი 

# 5)ახსენით როგორ იწერება და გამოიყენება for loopი დეტალურად

# 6)for loop ის მეშვეობით დაბეჭდეთ 0 დან 20 მდე რიცხვები და გამოიტანეთ მხოლოდ ლუწი რიცხვები ტერმინალში

# 7)for loop-ის მეშვეობით დაბეჭდეთ 75-დან 150-მდე ყველა კენტი რიცხვი

# 8)მომხმარებელს შემოატანინეთ ორი რიცხვი (start და stop) შემდეგ For ციკლში შექმენით რიცხვების დიაპაზონი startდან stopმდე

# 9)შექმენით ცხვლადი სადაც შეინახავთ ერთ დიდ რიცხვს სტრინგის სახით, მაგ: "76559875466" შემდეგ გადაუარეთ for ციკლით და შეამოწმეთ მისი თითოეული რიცხვი ციფრი მეტია თუ არა 4ზე

# dv 1
for i in range(11):
    print(i)

# dv 2
name = "daviti"
for i in range(100):
    print(name)

# dv 3
name = "daviti"
for i in name:
    print(i)

# dv 4
for i in range(20, 2):
    print(i)

# dv 5
# ცვლადი — ეს არის ციკლის ცვლადი, რომელიც ყოველ გამეორებაზე მიიღებს მასივის ერთ ელემენტს.

# in — ნიშნავს "შეისწავლე ელემენტი ამ კოლექციიდან".
#  da range ში შეგვილია შევინახოთ სტარტი  გაჩერების ადგილი და გამოტოვება

# dv 6
for i in range(20, 2):
    print(i)

# dv 7
for i in range(75, 150, 2):
    print(i)

# dv 8
for i in range(75, 100):
    print(i)

# dv 9
number = "76559875466"
for i in number:
    print(int(int(i) <= 4))


