// 2) გამოიტანე კონსოლში შემდეგი მოქმედებების პასუხები:
//       10 - 3 
//       4 × 6
//       20 ÷ 5
console.log(10 - 3)
console.log(4 * 6)
console.log( 20 / 5)

// 3) კონსოლში დაბეჭდე შენი სახელი და გვარი
console.log("Davit kakalashvili")

// 4) გააკეთეთ თითო მათემატიკურ ოპერაციაზე 3-3 მაგალითი, სასურველია რომ ყველა მათემატიკურ ოპერაციაში იყოს გამოყენებული რიცხვი 10
console.log(10 + 5)
console.log(10 + 10)
console.log(10 + 7)
console.log(10 - 3)
console.log(10 - 100)
console.log(10 - 6)
console.log(10 * 7)
console.log(10 * 14)
console.log(10 * 67)
console.log(100000 / 10)
console.log(908763 / 10)
console.log(677676766767 / 10)
console.log(69969696 % 10)
console.log(246780 % 10)
console.log(100099 % 10)

// // 5)კომენტარის სახით ახსენით დღეს ახსნილი მასალა დეტალურად (რა არის js, რაში ვიყენებთ, რა არის console, რა ხდება სტრინგნის და ინტეჯერის მიმატებისას და ასე შემდეგ
//  js არის საიტის ფუნქციონალიზმი console არის იგვე print პითონიდან სტრინგის და ინტეჯერის მიმატებისას თავისულად ემატება ერთმანეთს რადგან ინტეფერს გადააქცევს სტრინგად და ისე მიემატება ერთმაეთშ
