# 1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.

# 2)შექმენით სია სადაც იქნება 10 ელემენტი გამოიტანეთ,მე0 ინდექსიდან მე_8 ინდექსის ჩათვლით ყველა ელემენტი.

# 3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.

# 4) მომხმარებელს შემოატანინეთ მისი სახელი დიდი ასოებით და შეინახეთ ცვლადში სახელად name და .lower() ფუნქციის მეშვეობით გადააქციეთ ცვლადის მნიშვნელობა  პატარა ასოებად. 

# 5) ცვლადში შეინახეთ თქვენი გვარი პატარა ასოებით, შემდეგ .upper() ფუნქციის მეშვეობით გადააქციეთ ცვლადის მნიშვნელობა  დიდ ასოებად.

# 6) ცვლადში შეინახეთ სტრინგი პატარა ასოებით, შემდეგ .capitalize() ფუნქციის მეშვეობით გადააქციე პირველი ასო დიდ ასოდ.

# 7)შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა ორი რიცხვი შემდეგ კი გამოიტანეთ ამ რიცხვების ჯამი.

# 8)შექმენით ფუნქცია რომელსაც გადაეცემა არგუმენტად რიცხვი შემდეგ კი მან უნდა დაგვიბრუნოს ლუწია ეს რიცხვი თუ კენტი.

# 9)შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა რიცხვი შემდეგ კი მან უნდა დაგვიბრუნოს ეს რიცხვი დადებითია თუ უარყოფითი.



# dv 1
num1 = [1, 2, 3, 4, 5]
num2 = 1

for num in num1:
    num2 = num2 * num
    print(num2)


# dv 2
name = ["nika", "daviti", "aleqsandre", "luka", "giorgi", "gio", "mari", "taso", "nazi", "cotne"]
print(name[0 : 7])


# dv 3
numbers = [2, 7, 4, 9, 3]
for num in numbers:
    if num < 5:
        print(num)


# dv 4
name = input("შეიყვანე შენი სახელი დიდი ასოებით")
print(name.lower())


# dv 5
name = "daviti"
print(name.upper())


# dv 6
name = "aleqsandre"
print(name.capitalize())

# dv 7
def number(a, b):
    result = a + b
    print(result)
number(10, 6)

# dv 8
def even_or_odd(number):
    if number % 2 == 0:
        return "რიცხვი ლუწია"
    else:
        return "rიცხვი კენტია"

result = even_or_odd(10)
print(result)

# dv 9
def chek_number(number):
    if number > 0:
        return "რიცხვი დადებითია"
    elif number < 0:
        return "რიცხვი უარყოფითია"
    else:
        return "რიცხვი ნულია"
    
print(chek_number(1))