// 1) შექმენი ფუნქცია Function declaration ის გამოყენებით (ცვლადში რომ ვინახავდით ფუნქციას) რომელსაც გადაეცემა 1 არგუმენტი name
// შემოწმება1: თუ სახელი შედგება 5 ასოთი ან ნაკლებით გამოიტანე პატარა სახელი გაქვს სხვა შემთხვევაში დიდი სახელი გაქვს
function user_name(name){
    if (name.length <= 5) {
        console.log("პატარა სახელი გაქვს");
    } else {
        console.log("დიდი სახელი გაქვს");
    }
}
// 2) შექმენი arrow function (ისარით რომ ვქმნიდით) რომელსაც გადაეცემა 1 არგუმენტი number თუ number არის ლუწი გამოიტანე "even" თუ არის კენტი გამოიტანე "odd" (ეს ყველაფერი 1 ხაზზში უნდა გააკეთოთ)
const checkNumber = number => number % 2 === 0 ? "even" : "odd";
// 3)წარმოიდგინე, რომ წერ კოდს ნაყინის აპარატისთვის. უნდა შექმნა ფუნქცია buyIceCream, რომელიც მიიღებს ორ არგუმენტს:

// money (ფული - რიცხვი)

// isMachineWorking (მუშაობს თუ არა აპარატი - ბულეანი: true ან false)

// ნაყინი ღირს 3 ლარი. აპარატს აქვს მხოლოდ 2 წესი:

// წესი 1: შემოწმება მუშაობს თუ არა. თუ აპარატი გაფუჭებულია (isMachineWorking === false), ფუნქციამ უნდა დააბრუნოს: "აპარატი არ მუშაობს!"

// წესი 2: ფულის შემოწმება. თუ ბავშვს აქვს 3 ლარი ან მეტი, ფუნქციამ უნდა დააბრუნოს ხურდა: "ნაყინი მზად არის! შენი ხურდაა: X ლარი." (X-ის ნაცვლად ფულს გამოკლებული 3 ლარი). სხვა შემთხვევაში (თუ ფული არ ყოფნის) დააბრუნოს: "ნაყინისთვის ფული არ გყოფნის!"
function buyIceCream(money, isMachineWorking) {
    if (isMachineWorking === false) {
        return "აპარატი არ მუშაობს!";
    } else if (money >= 3) {
        return `ნაყინი მზად არის! შენი ხურდაა: ${money - 3} ლარი.`;
    } else {
        return "ნაყინისთვის ფული არ გყოფნის!";
    }
}

// 4)
// წარმოიდგინე, რომ წერ პროგრამას აკვაპარკის ჭკვიანი კარებისთვის. უნდა შექმნა ფუნქცია სახელად canRide, რომელიც მიიღებს სამ არგუმენტს:

// height (ბავშვის სიმაღლე სანტიმეტრებში - რიცხვი)

// hasAdultWithThem (ახლავს თუ არა უფროსი - ბულეანი: true ან false)

// hasVIPPass (აქვს თუ არა VIP ბილეთი - ბულეანი: true ან false)

// ატრაქციონზე შესვლის მკაცრი წესები ასეთია:

// წესი 1: სიმაღლის ბარიერი. თუ ბავშვის სიმაღლე არის 140 სმ ან მეტი, ის ატრაქციონზე ნებისმიერ შემთხვევაში დაიშვება. ფუნქციამ უნდა დააბრუნოს: "კეთილი იყოს თქვენი მობრძანება! შეგიძლიათ შეხვიდეთ."

// წესი 2: უფროსის თანხლება. თუ ბავშვის სიმაღლე არის 120-დან 139 სმ-მდე (ანუ 120-ზე მეტი ან ტოლია) და ამავდროულად მას ახლავს უფროსი (hasAdultWithThem === true), ის მაინც დაიშვება. ფუნქციამ უნდა დააბრუნოს იგივე ტექსტი: "კეთილი იყოს თქვენი მობრძანება! შეგიძლიათ შეხვიდეთ."

// წესი 3: VIP გამონაკლისი. თუ ბავშვი სიმაღლით 120 სმ-ზე ნაკლებია, წესით არ დაიშვება, მაგრამ თუ მას აქვს VIP ბილეთი (hasVIPPass === true), კარები მას მაინც გაუღებს. ფუნქციამ უნდა დააბრუნოს: "VIP დაშვება აქტიურია! ისიამოვნეთ ატრაქციონით."

// წესი 4: უარი. ყველა სხვა შემთხვევაში (მაგალითად, თუ დაბალია და არც უფროსი ჰყავს და არც VIP ბილეთი), ფუნქციამ უნდა დააბრუნოს: "სამწუხაროდ, ამ ატრაქციონზე ვერ შეხვალთ უსაფრთხოების წესების გამო."

function canRide(height , hasAdultWithThem , hasVIPPass ){
    if(height >= 140){
        return "კეთილი იყოს თქვენი მობრძანება! შეგიძლიათ შეხვიდეთ."
    }else if(height >= 120 & height < 139 & hasAdultWithThem === true){
        return "კეთილი იყოს თქვენი მობრძანება! შეგიძლიათ შეხვიდეთ."
    }else if(height < 120 & hasVIPPass === true ){
        return "VIP დაშვება აქტიურია! ისიამოვნეთ ატრაქციონით."
    }else{
        return "სამწუხაროდ, ამ ატრაქციონზე ვერ შეხვალთ უსაფრთხოების წესების გამო."
    }
}