
# 2) მომხმარებელს შემოატანინეთ სიტყვა, შემდეგ if-ით შეამოწმეთ ეს სიტყვა თუ თავისი თავის ტოლია როდესაც შემოაბრუნებთ (slicing-ის დახმარებით), თუ ასეა დაბეჭდეთ რომ განსაკუთრებული (ასეთ სიტყვებს palindrome ჰქვია) სიტყვაა, სხვა შემთხვევაში კი დაბეჭდეთ რომ ჩვეულებრივი სიტყვაა.

# 3) შექმენით სიტყვების სია, შემდეგ მის შემობრუნებულ ვერსიას გადაუარეთ for ციკლით, დაბეჭდეთ ყოველი მეორე ელემენტი (რომ გაიგოთ ყოველი მეორე აიღეთ ცვლადი რომელიც თავიდან 0 იქნება, ყოველ გამეორებაზე კი გაზრდით ერთით და შეამოწმეთ ლუწია თუ კენტი)

# 4) მომხმარებელს შემოატანინეთ სიტყვა და დაბეჭდეთ ის შებრუნებულად

# 5) შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს string ხუთგვარად შემდეგი პირობებით:
#  - მხოლოდ პირველი 5 სიმბოლო
#  - ბოლო 4 სიმბოლო
#  - შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
#  - მთელი სტრინგი შებრუნებულად
#  - სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე

# dv 1
word = input("შეიყვანე სიტყვა; ")
reversed_word = word[::-1]

if word == reversed_word:
    print('palindrome')
else:
    print("ეს ჩვეულებრივი სიტყვაა")


# dv 2

words = ["apple", "banana", "cherry", "date", "fig", "grape"]
reversed_words = words[::-1]
count = 0

for word in reversed_words:
    if count % 2 == 0:
        print(word)
    count += 1

# dv 3
word2 = input("შეიტანე რიცხვი; ")
print(word[ : :-1])

# dv4
word = "sadsrtfgydgertudietg"
print(word[0:6])
print(word[-1:-4])
print(word[4:10])
print(word[ : :])
print(word[0: :2])