# 1) შექმენით ფუნქცია რომელსაც გადასცემთ ერთ პარამეტრს age 'ს თუ age აღემატება 18 მაშინ დაპრინტეთ "შენ ხარ სრულწლოვანი" სხვაშემთხვევაში "შენ არხარ სრულწლოვანი"

# 2) კომენტარის სახით ახსენით რას ნიშნავს და რაში გამოიყენება if-else სთეითმენთი 

# 3) კომენტარის სახით ახსენით while loop'ები 

# 4) while loop ის დახმარებით გამოიტანეთ რიცხვები 100 დან 0 'ის ჩათვლით 

# 5) შექმენით ცვლადი სადაც მომხმარებელს შემოატანინებთ მის ასაკს თუ მისი ასაკი აღემატება ან ტოლია 18 მაშინ დაპრინტეტ "თქვენ გადაიხდით რეგულარული ფასებით" სხვა შემთხვევაში დაპრინტეთ "თქვენ მიიღეთ 20% ფასდაკლება"

# dv 1
age = int(input("enter your age:"))
if age >= 18:
    print("შენ ხარ სრულწლოვანი")
else:
    print("შენ არხარ სრულწლოვანი")


# dv 2
# if-else სთეითმენტი გამოიყენება პირობის შემოწმებისთვის პროგრამაში.
# ის ეუბნება პროგრამას: "თუ პირობა შესრულდა, შეასრულე ერთი  კოდი, 
# ხოლო თუ პირობა არ შესრულდა — შეასრულე სხვა ბლოკი."

# dv 3
# while loop — იმეორებს მოქმედებებს მანამ, სანამ პირობა (condition) არის True

# ვქმნით ცვლადს, რომელსაც დავიწყებთ 0-ით
count = 0

# ეს while loop იმუშავებს მანამ, სანამ count ნაკლებია 5-ზე
while count < 5:
    # დაბეჭდავს count-ის მიმდინარე მნიშვნელობას
    print("Count არის:", count)
    
    # count-ს ვზრდით 1-ით ყოველ იტერაციაზე, რომ ბოლოს და ბოლოს პირობა false გახდეს
    count += 1

# როცა count გახდება 5 ან მეტი, while loop შეწყვეტს მუშაობას

# dv 4
i = 0
while i <= 100:
    print(i)
    i = i + 1

# dv 5
age= int(input("enter your age:"))
if age >= 18:
    print("თქვენ გადაიხდით რეგულარული ფასებით")
else:
    print("თქვენ მიიღეთ 20% ფასდაკლება")