// 1)
// დააგენერირე რენდომ რიცხვი 1-დან 100-მდე
// და გამოიტანე:
// "ეს რიცხვი დამრგვალების შემდეგ არის: "
// (Math.round() გამოიყენე)
console.log("ეს რიცხვი დამრგვალების შემდეგ არის: ", Math.round(Math.random()*99)+1)
// 2)
// მოცემულია რიცხვები: 12.4 და 12.6
// ორივე დაამრგვალე და გამოიტანე შედეგები ცალ-ცალკე.
console.log(Math.round(12.4))
console.log(Math.round(12.6))

// 3)
// იპოვე ყველაზე პატარა რიცხვი ამ სიიდან და მერე აიყვანე კვადრატში:
// 8, 3, 5, 1
console.log(Math.pow(Math.min(8, 3, 5, 1)* 2))
// 4)
// დააგენერირე რენდომ რიცხვი 1-დან 50-მდე
// და იპოვე მისი კვადრატული ფესვი.
console.log(Math.sqrt(Math.random()*49)+1)
// 5)
// კონსოლში გამოიტანე ტექსტი:
// "რენდომ რიცხვი 0-დან 10-მდე: "
// და გვერდით დაუმატე დაგენერირებული მთელი რიცხვი.
console.log("რენდომ რიცხვი 0-დან 10-მდე: ",Math.random()*9)