// დავალება 1: Function Expression (ცვლადში შენახული ფუნქცია)
// შექმენი ფუნქცია Function Expression-ის გამოყენებით (ცვლადში რომ ვინახავთ), სახელად checkPassword, რომელსაც გადაეცემა 1 არგუმენტი: password (სტრინგი).

// შემოწმება: თუ პაროლის სიგრძე არის 8 სიმბოლო ან მეტი, ფუნქციამ უნდა გამოიტანოს (ან დააბრუნოს): "ძლიერი პაროლია".

// სხვა შემთხვევაში: გამოიტანოს: "სუსტი პაროლია, ძალიან მოკლეა!".

const checkPassword = function(password){
    if(password.lenght >= 8){
        return  "ძლიერი პაროლია"
    }else{
        return "სუსტი პაროლია, ძალიან მოკლეა!"
    }
}

// დავალება 2: Arrow Function ერთ ხაზზე (ისრიანი ფუნქცია)
// შექმენი Arrow function სახელად isPositive, რომელსაც გადაეცემა 1 არგუმენტი: number.

// თუ რიცხვი 0-ზე მეტია, გამოიტანოს "positive".

// თუ 0-ზე ნაკლებია ან 0-ის ტოლია, გამოიტანოს "negative or zero".

// მთავარი პირობა: ეს ყველაფერი უნდა დაწერო ზუსტად 1 ხაზში (Ternary operator-ის ? : გამოყენებით).
const isPositive = number => number > 0 ? "positive" : "negative or zero";

// დავალება 3: კინოთეატრის ბილეთების აპარატი (Arrow Function)
// წარმოიდგინე, რომ წერ კოდს კინოთეატრის თვითმომსახურების აპარატისთვის. უნდა შექმნა აისრიანი ფუნქცია (Arrow function) სახელად buyMovieTicket, რომელიც მიიღებს ორ არგუმენტს:

// age (ასაკი - რიცხვი)

// money (თანხა - რიცხვი)

// ბილეთი ღირს 10 ლარი. აპარატს აქვს 2 წესი:

// წესი 1: ასაკის შემოწმება. თუ ასაკი 12 წელზე ნაკლებია, ფილმზე არ დაიშვება და ფუნქციამ უნდა დააბრუნოს: "ამ ფილმზე ასაკი არ გიწყობს ხელს!".

// წესი 2: ფულის შემოწმება. თუ ასაკი ხელს უწყობს და მას აქვს 10 ლარი ან მეტი, ფუნქციამ უნდა დააბრუნოს ხურდა: "ბილეთი ბეჭდვა დაიწყო! შენი ხურდაა: X ლარი." (X-ის ნაცვლად ფულს გამოკლებული 10 ლარი). სხვა შემთხვევაში (თუ ფული არ ყოფნის) დააბრუნოს: "ბილეთისთვის ფული არ გყოფნის!".

// შეცდომა. ყველა სხვა შემთხვევაში (მაგალითად, თუ ცივა და გადაუდებელი ღილაკიც გამორთულია), ფუნქციამ უნდა დააბრუნოს: "სისტემური შეცდომა! მცენარეები საფრთხეშია.".

// დავალება 4: სმარტფონის დამტენი სადგური
// შექმენი ფუნქცია სახელად chargePhone, რომელიც მიიღებს სამ არგუმენტს:

// batteryLevel (ელემენტის პროცენტი - რიცხვი 0-დან 100-მდე)

// hasCharger (აქვს თუ არა დამტენი კაბელი - ბულეანი: true ან false)

// isPowerBank (PowerBank-ით ტენის თუ ჩვეულებრივი დენის წყაროთი - ბულეანი: true ან false)

// წესები ასეთია:

// წესი 1: სავსე ელემენტი. თუ batteryLevel არის 100, ტელეფონი ისედაც სავსეა. ფუნქციამ უნდა დააბრუნოს: "ტელეფონი უკვე 100%-ით დატენილია!".

// წესი 2: დამტენის არქონა. თუ batteryLevel 100-ზე ნაკლებია, მაგრამ ბავშვს/მომხმარებელს დამტენი კაბელი არ აქვს (hasCharger === false), ფუნქციამ უნდა დააბრუნოს: "ვერ დატენი, დამტენი კაბელი არ გაქვს.".

// წესი 3: სწრაფი დატენვა. თუ მას აქვს კაბელი (hasCharger === true) და ამავდროულად ტენის დენის წყაროდან და არა PowerBank-იდან (isPowerBank === false), ფუნქციამ უნდა დააბრუნოს: "სწრაფი დატენვა აქტიურია!".

// წესი 4: სტანდარტული დატენვა. ყველა სხვა შემთხვევაში (ანუ აქვს კაბელი, მაგრამ ტენის PowerBank-ით), ფუნქციამ უნდა დააბრუნოს: "ტელეფონი იტენება სტანდარტული სიჩქარით.".
function chargePhone(batteryLevel ,hasCharger , isPowerBank){
    if(batteryLevel === 100){
        return "ტელეფონი უკვე 100%-ით დატენილია!"
    }else if(batteryLevel < 100 & hasCharger === false){
        return "ვერ დატენი, დამტენი კაბელი არ გაქვს."
    }else if(hasCharger === true & isPowerBank === false){
        return "სწრაფი დატენვა აქტიურია!"
    }else{
        return "ტელეფონი იტენება სტანდარტული სიჩქარით."
    }
}



// დავალება 5: ჭკვიანი სათბურის კონტროლერი
// შექმენი ფუნქცია სახელად greenhouseAlert, რომელიც მიიღებს სამ არგუმენტს:

// temperature (ტემპერატურა ცელსიუსში - რიცხვი)

// isWaterSystemOn (ჩართულია თუ არა მორწყვის სისტემა - ბულეანი: true ან false)

// hasEmergencyOverride (გადაუდებელი მართვის ღილაკი ჩართულია თუ არა - ბულეანი: true ან false)

// წესები სათბურისთვის:

// წესი 1: კრიტიკული სიცხე. თუ ტემპერატურა არის 40 გრადუსი ან მეტი, სათბურს საფრთხე ემუქრება. ფუნქციამ უნდა დააბრუნოს: "განგაში! სათბურში კრიტიკული ტემპერატურაა!".

// წესი 2: ნორმალური რეჟიმი. თუ ტემპერატურა არის 18-დან 39 გრადუსამდე და მორწყვის სისტემა ჩართულია (isWaterSystemOn === true), ყველაფერი რიგზეა. ფუნქციამ უნდა დააბრუნოს: "სისტემა მუშაობს სტაბილურად.".

// წესი 3: ხელით მართვა (VIP რეჟიმი). თუ ტემპერატურა 18 გრადუსზე ნაკლებია (ცივა), წესით მცენარეები დაზიანდება, მაგრამ თუ ჩართულია გადაუდებელი მართვის ღილაკი (hasEmergencyOverride === true), სისტემა მაინც დაცულია. ფუნქციამ უნდა დააბრუნოს: "ჩართულია ხელით მართვის რეჟიმი, ტემპერატურა კონტროლდება.".

// წესი 4: სისტემური შეცდომა. ყველა სხვა შემთხვევაში (მაგალითად, თუ ცივა და გადაუდებელი ღილაკიც გამორთულია), ფუნქციამ უნდა დააბრუნოს: "სისტემური შეცდომა! მცენარეები საფრთხეშია.".

function greenhouseAlert(temperature,isWaterSystemOn,hasEmergencyOverride){
    if(temperature >= 40){
        return "განგაში! სათბურში კრიტიკული ტემპერატურაა!"
    }else if(temperature >= 18 & temperature <= 38 & isWaterSystemOn === true){
        return  "სისტემა მუშაობს სტაბილურად."
    }else if(temperature < 18 & hasEmergencyOverride == true){
        return "ჩართულია ხელით მართვის რეჟიმი, ტემპერატურა კონტროლდება."
    }else{
        return "სისტემური შეცდომა! მცენარეები საფრთხეშია."
    }
}