# 1)შექმენით dictionary სადაც შენახული იქნება შენი სახელი, ასაკი და ქალაქი.

# შემდეგ ამოიღეთ კონკრეტული მნიშვნელობა და შეინახე ცვლადში.

# ასევე შეცვალეთ რომელიმე მნიშვნელობა რაც გექნება dictionary ში.

# წაშალე ერთი ელემენტი.

# ასევე გამოიტანეთ მხოლოდ value ები


# # ახსენით თითოეული მეთოდი კომენტარებით თუ რას აკეთებს.



me = {
    "name": "daviti",
    "age": 13,
    "city": "mcxeta"
}

person_age = me["age"]
me["city"] = "tbilisi"
me.pop("name")
me.values()

# clear() - ასუფთავებს dictionary
# copy() -გვიბრუნებს დაკოპირებულ dictionary
# fromkeys() - აბრუნებს გასაღებს თავისი განახლებული მნიშჰვენოლბით
# get() - გვიბრუნებს მნიშვნელობას თავისი გასაღებით
# items() - აბრუნებს სიას რომელიც შეიცავს tuples  თითოეული გასაღებით და წყვილით