// 1)
// კონსოლში გამოიტანე რიცხვი 7.8 დამრგვალებული უახლოეს მთელ რიცხვამდე.
console.log(Math.round(7.8))

// 2)
// მომხმარებლის გარეშე დაწერე კოდში უარყოფითი რიცხვი და გამოიტანე მისი მოდული Math.abs() გამოყენებით.
console.log(Math.abs(-67))

// 3)
// იპოვე 81-ის კვადრატული ფესვი და გამოიტანე კონსოლში.
console.log(Math.sqrt(81))

// 4)
// კონსოლში გამოიტანე ამ რიცხვებიდან ყველაზე პატარა:
// 5, 2, 9, -4, 12
console.log(Math.min(5,2,9,-4,12))
// 5)
// კონსოლში გამოიტანე ამ რიცხვებიდან ყველაზე დიდი:
// 3, 15, 7, 22, 1
console.log(Math.max(3,15,7,22,1))

// 6)
// აიყვანე 6 მეორე ხარისხში Math.pow() გამოყენებით და გამოიტანე პასუხი.
console.log(Math.pow(6 , 2))
// 7)
// დააგენერირე 0-დან 9-მდე ნებისმიერი რენდომ მთელი რიცხვი.
console.log(Math.floor(Math.random() * 9))
// 8)
// დააგენერირე 1-დან 20-მდე ნებისმიერი რენდომ მთელი რიცხვი.
console.log(Math.floor(Math.random() * 19)+1)
// 9)
// დააგენერირე რენდომ რიცხვი და დაამრგვალე ქვემოთ ისე, რომ მიიღო მთელი რიცხვი.
console.log(Math.floor(Math.random()))


// 1)
// დააგენერირე რენდომ რიცხვი 1-დან 10-მდე და გამოიტანე ტექსტთან ერთად:
// "დაგენერირდა რიცხვი: "
console.log("დაგენერირდა რიცხვი: ",Math.random() * 9)

// 2)
// მოცემულია რიცხვი -36.
// იპოვე მისი მოდული და შემდეგ ამ მოდულის კვადრატული ფესვი.
console.log(Math.abs(-36));     
console.log(Math.sqrt(Math.abs(-36)));  

// 3)
// იპოვე ამ რიცხვების საშუალოდ დამრგვალებული მნიშვნელობა:
// 4, 7, 9
// (ჯერ იპოვონ საშუალო და მერე გამოიყენონ Math.round())
console.log(Math.round((4 + 7 + 9) / 3));
// 4)
// დააგენერირე ორი რენდომ რიცხვი 1-დან 10-მდე
// და კონსოლში გამოიტანე მათ შორის უდიდესი.

// 5)
// გამოიტანე კონსოლში:
// "5-ის მესამე ხარისხი არის: "
// და გვერდით დაუწერე შედეგი Math.pow() გამოყენებით.
console.log("5-ის მესამე ხარისხი არის: ",Math.pow(5,3))
