# 1) კომენტარის სახით ახსენით რა განსხვავებაა  while loop-სა და for loop-ს შორის.

# 2) for loop-ის დახმარებით გამოიტანეთ ყველა ლუწი რიცხვი 10-დან 50-მდე.

# 3) while loop-ის დახმარებით გამოიტანეთ ყველა კენტი რიცხვი 0-დან 20-მდე.

# 4) მომხმარებელს შემოატანინეთ რაიმე სიტყვა და ამ სიტყვას for loop-ით გადაუარეთ, გამოიტანეთ ამ სიტყვის ყველა ასო.

# 5) მომხმარებელს შემოატანინეთ თავისი ასაკი, თუ მისი ასაკი ნაკლებია 18-ზე გამოიტანეთ "you are a child", თუ ტოლია 18-ის გამოიტანეთ "you just became an adult", ხოლო დანარჩენ შემთხვევებში გამოიტანეთ "you are an adult". გამოიყენეთ if/else.
 

# dv 1

# while loop გამოიყენება მაშინ, როდესაც არ ვიცით რამდენჯერ უნდა შესრულდეს ციკლი.
# იგი აგრძელებს მუშაობას მანამ, სანამ მოცემული პირობა მართალია (True).
# მაგ. ვიყენებთ სანამ გარკვეული პირობა არ შესრულდება.
# for loop გამოიყენება მაშინ, როდესაც ვიცით რამდენჯერ უნდა შესრულდეს ციკლი,
# ან გვინდა სიის ყველა ელემენტის გადავლა.


# dv 2 
for i in range(10, 50, 2):
    print(i)

# dv 3
i = 0

while i <= 20:
    if i % 2 == 1:
        print(i)
    i += 1


# dv 4
word = input("დაწერე რაიმე სიტყვა:")
for i in word:
    print(i)

# dv 5
age = int(input("enter your age:"))
if age < 18:
    print("you are a child")
elif age== 18:
    print("you just became an adult")
else:
    print("you are an adult")