# 1)მოხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შემოატრიალეთ ეს გვარი და გადაურეთ for ციკლით.

# 2)კომენტარის სახით ახსენით რაში ვიყენებთ sliceing-ს და რაში ვიყენებთ indexing-ს, ასევე დაწერეთ რა განსხვავებაა მათ შორის.

# 3)შექმენით 10 ელემენტიანი სია, და გამოიტენეთ ამ სიის მხოლოდ ლუწ ინდექსზე მდგომი ელემენტები (ანუ: 0,2,4,6... ინდექსები)

# 4)შექმენით სია, სადაც გექნებათ 10 სახელი, მომხმარებელს შემოატანინეთ შემდეგ ორი რიცხვი (პირველი უნდა იყოს დასაწყისი წერტილი, მეორე უნდა იყოს დასასრული წერტილი), შემდეგ გამოიტანეთ ამ სიის შესაბამისი ნაწილი, მომხმარებლის რიცხვების გამოყენებით

# 5)შექმენით სია სადაც იქნება 15 ელემენტი, შემდეგ მომხმარებელს შემოატანინეთ ერთი რიცხვი და sliceing-ის გამოყენებით გამოიყენეთ ეს რიცხვი როგორც step (სიტყვაზე შემოიტანა რიცხვი 3, თქვენ ამ სიის ყოველი მესამე ელემენტი უნდა გამოიტანოთ)

# 6)მომხმარებელს შემოატანინეთ მისი გვარი, თუ გვარი სრულდება "shvili"-თ, მაშინ დაუბეჭდეთ "Hello", სხვა შემთხვევაში "Byee"


# dv 1
surname=input("enter your surname: ")
print(surname[ : : -1])

# dv 2
# Slicing - გამოიყენება სტრინგიდან ან სიიდან ელემენტების შუალედის ამოსაღებად
# Indexing - გამოიყენება სტრინგში ან სიაში კონკრეტული ელემენტის მისაღებად 

# dv 3
name = ["nika", "gio", "giorgi", "daviti", "mari", "anastasia", "nika", "nikolozi", "cira", "taso"]
print(name[ : : 2])


# dv 4
names = ["ანა", "ნინო", "თეკლა", "სოფო", "ლიკა", "მარიამი", "ქეთი", "თამუნა", "ლელა", "ელენე"]
start = int(input("შეიყვანე დასაწყისი ინდექსი: "))
end = int(input("შეიყვანე დასასრული ინდექსი: "))
print("შერჩეული ნაწილი:", names[start:end])


# dv 5
# 15 სახელი
names = [
    "ანა", "ნინო", "თეკლა", "სოფო", "ლიკა",
    "მარიამი", "ქეთი", "თამუნა", "ლელა", "ელენე",
    "დათო", "გიორგი", "ლაშა", "ირაკლი", "ბექა"
]
step = int(input("შეიყვანე რიცხვი (step): "))
print(names[::step])

# dv 6
surname = input("შეიყვანე შენი გვარი: ")

if surname[-6:] == "shvili":
    print("Hello")
else:
    print("Byee")
